app/Models/ModelKategori.php

    public function AllData() {
        return $this->findAll();
---
SELECT *
FROM `tbl_kategori`

    public function UpdateData($data)
    {
        return $this->update($data['id_kategori'], $data);
---
UPDATE `tbl_kategori` SET `nama_kategori` = 'DATA1'
WHERE `tbl_kategori`.`id_kategori` IN ('1')

     public function DeleteData($data)
    {
        return $this->delete($data['id_kategori']);
---
DELETE FROM `tbl_kategori`
WHERE `id_kategori` IN ('1')