app/Models/ModelSatuan.php

SELECT *
FROM `tbl_satuan`
---
    public function AllData() {
        // return $this->db->table('tbl_satuan')
        //     ->get()
        //     ->getResultArray();
        return $this->findAll();

INSERT INTO `tbl_satuan` (`nama_satuan`) VALUES ('Kaleng')
---
    public function InsertData($data)
    {
        // $this->db->table('tbl_satuan')->insert($data);
        return $this->insert($data);

UPDATE `tbl_satuan` SET `nama_satuan` = 'gram2'
WHERE `tbl_satuan`.`id_satuan` IN ('9')
---
    public function UpdateData($data)
    {
        // $this->db->table('tbl_satuan')
        // ->where('id_satuan', $data['id_satuan'])
        // ->update($data);

        return $this->update($data['id_satuan'], $data);

DELETE FROM `tbl_satuan`
WHERE `id_satuan` IN ('9')
---
     public function DeleteData($data)
    {
        // $this->db->table('tbl_satuan')
        // ->where('id_satuan', $data['id_satuan'])
        // ->delete($data);
        return $this->delete($data['id_satuan']);